{"data":{"site":{"siteMetadata":{"title":"Gatsby Blog"}},"markdownRemark":{"html":"<h1>What are browser APIs?</h1>\n<p>Once Gatsby has waved its magic wand and generated all the files, it then serves them to the browser. Sometimes, it needs a little help along the way to get exactly what you're looking for.</p>\n<p>Gatsby's browser APIs are little hooks into its world that hand control back to the developer.</p>\n<h1>Where do they live?</h1>\n<p>All browser API calls live inside <code>gatsby-browser.js</code>. This is situated at the root of the document, which Gatsby picks up automatically.</p>\n<p>There's plenty of APIs going around, but here's a few of the most useful.</p>\n<h2>onClientEntry</h2>\n<p>Gatsby has its own browser runtime. If you need to know when this kicks in, this is the place to do it. This is useful for measuring load times or triggering other items to load.</p>\n<pre><code class=\"language-js\">exports.onClientEntry = () => {\n  loadContent();\n};\n</code></pre>\n<h2>onRouteUpdate</h2>\n<p>This gets called whenever some kind of internal navigation happens. This can be useful for triggering analytics for example.</p>\n<p>The function is also passed information about the update, including the new location.</p>\n<pre><code class=\"language-js\">exports.onRouteUpdate = ({ location }) => {\n  analytics.fire(location);\n};\n</code></pre>\n<p>Before this is called, <code>onPreRouteUpdate</code> is fired. Use this instead if knowing ahead of time is important.</p>\n<h2> onRouteUpdateDelayed</h2>\n<p>As Gatsby splits out sites into chunks, it has to go and fetch the relevant chunk each time the route changes.</p>\n<p>If that load is particularly slow, its good to know about that. The <code>onRouteUpdateDelayed</code> function is called each time the chunk doesn't arrive in a timely fashion. This is currently defined as 1 second.</p>\n<pre><code class=\"language-js\">exports.onRouteUpdateDelayed = () => {\n  console.log(\"Loading...\");\n};\n</code></pre>\n<h1> Where can I find out about the rest?</h1>\n<p>The <a href=\"https://www.gatsbyjs.org/docs/browser-apis/\">Gatsby site</a> holds all the rest of them including how to call them.</p>","frontmatter":{"date":"December 04, 2018","path":"/post/browser-apis","title":"Browser APIs"}}},"pageContext":{}}