{"data":{"allMarkdownRemark":{"edges":[{"node":{"excerpt":"What are SSR APIs? While Gatsby pre-renders the site, there may be extra things you need to tell it to be able to render correctly. These functions act as hooks into that process to provide functionality where it's needed. Where do they live? SSR APIs can be called by Gatsby so long as they are…","frontmatter":{"date":"05 December 2018","path":"/post/ssr-apis","tags":["Gatsby","node","server","ssr","rendering"],"title":"Server-side Rendering APIs"}}},{"node":{"excerpt":"What are browser APIs? Once Gatsby has waved its magic wand and generated all the files, it then serves them to the browser. Sometimes, it needs a little help along the way to get exactly what you're looking for. Gatsby's browser APIs are little hooks into its world that hand control back to the…","frontmatter":{"date":"04 December 2018","path":"/post/browser-apis","tags":["Gatsby","browser","javascript","service workers"],"title":"Browser APIs"}}},{"node":{"excerpt":"What are Node APIs? Gatsby builds your site using Node. It provides a small set of APIs to allow you to tap into its working and help you guide it in the right direction. For example Gatsby will only pick up certain pages by default. By using the Node APIs it's possible to help create other pages…","frontmatter":{"date":"03 December 2018","path":"/post/node-apis","tags":["Gatsby","node","server","building"],"title":"Node APIs"}}},{"node":{"excerpt":"Where does Gatsby get configured? Everything that makes your Gatsby setup unique will pass through  gatsby-config.js . As long as it's placed at the root of your project, it will be picked up automatically. As long as it exports an object, it can contain any logic necessary to the site. What goes in…","frontmatter":{"date":"02 December 2018","path":"/post/setting-up-gatsby-config","tags":["Gatsby","config","js","bootstrapping"],"title":"Setting up Gatsby config"}}},{"node":{"excerpt":"What is a starter? A starter is exactly as it sounds - a starting point to build your next Gatsby project. They contain all the logic you need to get up and running in a few commons scenarios. While the more common ones are set up by Gatsby themselves, anybody can make a starter. All that is…","frontmatter":{"date":"01 December 2018","path":"/post/gatsby-starters","tags":["Gatsby","starter","npm","cli"],"title":"Gatsby Starters"}}}]}},"pageContext":{}}