{"data":{"site":{"siteMetadata":{"title":"Gatsby Blog"}},"markdownRemark":{"html":"<h1>What are SSR APIs?</h1>\n<p>While Gatsby pre-renders the site, there may be extra things you need to tell it to be able to render correctly. These functions act as hooks into that process to provide added behaviours where they're needed.</p>\n<h1>Where do they live?</h1>\n<p>SSR APIs can be called by Gatsby so long as they are stored within the <code>gatsby-ssr.js</code> file at the root of the project.</p>\n<p>Not all SSR APIs are useful. In fact, most sites will not need to apply them. Here's some of the common ones if you do need to.</p>\n<h2> onRenderBody</h2>\n<p>Gatsby will do two passes over each page - one will work out the contents of each page's <code>&#x3C;body></code> and a second will provide that information to the renderers for the rest of the page. This can be useful if the contents affects the <code>&#x3C;head></code>, such as adding <code>&#x3C;meta></code> tags.</p>\n<p>It gets passed several other functions such as <code>setHeadComponents</code> and <code>setBodyProps</code> to help get the data in the right place.</p>\n<pre><code class=\"language-js\">exports.onRenderBody = ({ setHeadComponents }) => {\n  setHeadComponents(...);\n}\n</code></pre>\n<h2>replaceRenderer</h2>\n<p>The default Gatsby server renderer does a pretty good job at displaying pages as expected.</p>\n<p>If there's something in your set up that manipulates React output (for example adding classes for styling), then the renderer will need to be replaced with something that knows how to do it.</p>\n<p>It's unlikely this will need to be done manually. It is more useful to plugin developers who need to tap into the renderer themselves.</p>\n<pre><code class=\"language-js\">exports.replaceRenderer = ({ bodyComponent }) => {\n  return renderToString(bodyComponent);\n};\n</code></pre>\n<h2>wrapPageElement</h2>\n<p>Sometimes it's useful to wrap the output in another component without having to do that across each individual page. This might be useful for something like analytics or even just some repeated UI like navigation.</p>\n<p>The function gets passed information about the page element being generated at the time so it can be included in the wrapped component.</p>\n<pre><code class=\"language-js\">export const wrapPageElement = ({ element }) => {\n  return &#x3C;Wrapper>{element}&#x3C;/Wrapper>;\n};\n</code></pre>\n<h1> Where can I find out about the rest?</h1>\n<p>The full reference of all SSR APIs is on the <a href=\"https://www.gatsbyjs.org/docs/ssr-apis/\">Gatsby site</a>.</p>","frontmatter":{"date":"5 December 2018","title":"Server-side Rendering APIs"}}},"pageContext":{}}